In [11]:
import pandas as pd

In this notebook, you will learn how to create a DataFrame as well as perform basic functions for manipulating it.

Scenario: You and your friends plan a trip to UK, specifically London. Your friend, Bob, wants you to check out hotels in the city. Ideally, he wants to consider the rough cost for spending 3 nights as well as how well the hotel is rated. He believes that the more expensive a hotel is, the better your experience will be. You decide to create a Dataframe based on your search.

The information are as follows (Name, Cost, Rating)
- Thistle London Trafalgar Square, $212, 8.4
- The Royal Horseguards, $245, 9.0
- The Clermont London, $253, 9.2
- Apex Temple Court Hotel, $192, 9.4
- Tower Suites by Blue Orchid, $170, 9.2

## Creating a DataFrame

Name your dataframe, hotel, and assign column names with values based on your search. Note: There's several ways to construct a dataframe. This is one of them.

In [73]:
hotel = pd.DataFrame({
    'Name': ['The Clermont London', 'Tower Suites by Blue Orchid', 'The Royal Horseguards', 'Thistle London Trafalgar Square', 'Apex Temple Court Hotel'],
    'Cost ($)': [253, 170, 245, 212, 192],
    'Rating': [9.2, 9.2, 9.0, 8.4, 9.4]
})

uncomment below [remove the # next to the dataframe name] to show the dataframe you created

In [40]:
# hotel

                              Name  Cost ($)  Rating
0              The Clermont London       253     9.2
1      Tower Suites by Blue Orchid       170     9.2
2            The Royal Horseguards       245     9.0
3  Thistle London Trafalgar Square       212     8.4
4          Apex Temple Court Hotel       192     9.4

## Adding a new column

Remember, Bob wants you to check how much the hotel is going to cost for 3 nights. You decide to add a column where cost x 3 nights. You can do this by dataframe[new column] = dataframe[existing column] * 3

In [86]:
hotel['Cost for three nights'] = hotel['Cost ($)'] * 3

In [88]:
hotel

                              Name  Cost ($)  Rating  Cost for three nights
0              The Clermont London       253     9.2                    759
1      Tower Suites by Blue Orchid       170     9.2                    510
2            The Royal Horseguards       245     9.0                    735
3  Thistle London Trafalgar Square       212     8.4                    636
4          Apex Temple Court Hotel       192     9.4                    576

## Sorting rows

Now using sort_values([column name], ascending=False), sort the entries by price.

In [95]:
hotel.sort_values('Cost for three nights', ascending=False)

                              Name  Cost ($)  Rating  Cost for three nights
0              The Clermont London       253     9.2                    759
2            The Royal Horseguards       245     9.0                    735
3  Thistle London Trafalgar Square       212     8.4                    636
4          Apex Temple Court Hotel       192     9.4                    576
1      Tower Suites by Blue Orchid       170     9.2                    510

What does adding 'ascending=False' do to the ordering of the rows? Type your answer in the cell below.

Which hotel is the cheapest? Which hotel is the most expensive to stay in?

In [ ]:
## Congrats! You've now helped your friend, Bob, figure out where y